  //ボタンを押した時に出てくる漢字の配列
  
  export const kotowazaSet = [
    {
      k: "刎頚(ふんけい)の交わり",
      m: "生死をともにするほど、非常に親しいことのたとえ",
    },
    {
      k: "鷸蚌(いつぼう)の争い",
      m: "2人で利益を争っているうちに、別の第三者に取られてしまう事。漁夫の利と同じ",
    },
    {
      k: "斗筲(とそう)の人、何ぞ算(かぞ)うるに足らんや",
      m: "器量の狭い人のたとえ",
    },
    { k: "華胥(かしょ)の国に遊ぶ", m: "いい気持ちで昼寝すること" },
    {
      k: "兄弟牆(かき)に鬩(せめ)げども外其の務(あなど)りを禦(ふせ)ぐ",
      m: "普段仲の悪い兄弟でも、外部からの侮辱を受ければ、力をあわせて戦うこと",
    },
    {
      k: "殷鑑(いんかん)遠からず",
      m: "手本となるものは、ごく身近にあるということのたとえ",
    },
    {
      k: "阿漕が(あこぎ)浦に引く網",
      m: "隠し事も、たびたび行えば広く知れ渡ってしまうことのたとえ",
    },
    {
      k: "他人の疝気(せんき)を頭痛に病む",
      m: "自分に関係のないことで、余計な心配をすること",
    },
    {
      k: "綸言(りんげん)汗の如し",
      m: "君主が一度言ったことは、訂正したり、取り消したりはできないということ",
    },
    {
      k: "九仞(きゅうじん)の功を一簣に虧く",
      m: "事が今にも成就しようとしているときに、手を抜いてため、完成しないこと",
    },
    { k: "柳絮(りゅうじょ)の才", m: "非凡な才女" },
    {
      k: "朝菌は晦朔(かいさく)を知らず",
      m: "短命であること、儚いことのたとえ",
    },
    {
      k: "滄海(そうかい)変じて桑田(そうでん)となる",
      m: "世の中の移り変わりが激しいこと",
    },
    {
      k: "疏(麤、疎、蔬)食(そし)をくらい水を飲み肱(ひじ)を曲げて之を枕とす",
      m: "貧しい生活でも、楽しく暮らしていること",
    },
    {
      k: "鷺(さぎ)を烏(からす)と言いくるめる",
      m: "事実をねじ曲げて、間違っていることを無理に正しいと言い張るたとえ",
    },
    {
      k: "騎虎(きこ)の勢い",
      m: "一度物事の勢いがついてしまうと、途中で辞められないということのたとえ",
    },
    { k: "桑楡(そうゆ)且(まさ)に迫らんとす", m: "死期が近づいていること" },
    {
      k: "蛟竜(こうりょう)雲雨を得",
      m: "まだ能力を発揮していなかった人物が、時運を囲ってその才能を発揮すること",
    },
    {
      k: "糟糟(そうこう)の妻は堂より下さず",
      m: "貧しい時から苦労をともにした妻は、自分が出世しても正妻から外さないこと",
    },
    {
      k: "蕎麦(そば)の花見て蜜を取れ",
      m: "何事も時機を逃さず行えというたとえ",
    },
    {
      k: "荒馬の轡は前から",
      m: "困難な問題に直面したときには、堂々と正面から挑んでいけば良いというたとえ",
    },
    {
      k: "渇しても盗泉の水を飲まず",
      m: "どんなに苦しい時でも、決して不正、不義は働かないこと",
    },
    {
      k: "豆腐に鎹(かすがい)、糠(ぬか)に釘",
      m: "手応えがなく、全く効き目がないたとえ",
    },
    { k: "明日ありと思う心の仇桜(あだざくら)", m: "世の中や人生が儚いたとえ" },
    { k: "鰯網で鯨捕る", m: "偶然の幸運のたとえ、またあるはずのないこと" },
    {
      k: "大行は細謹を顧みず",
      m: "大きなことを成し遂げようとする人は、些細なことにこだわらず、目標に向かって進んでいくこと",
    },
    {
      k: "大黒柱を蟻がせせる",
      m: "能力のないものが、それに見合わない大仕事に着手することのたとえ",
    },
    { k: "六日の菖蒲(あやめ)十日の菊", m: "時機に遅れてしまったことのたとえ" },
    {
      k: "鑢(やすり)と薬の飲み違い",
      m: "わずかな違いしかないように見えても、実際は全く異なることのたとえ、また早合点することのたとえ",
    },
    {
      k: "立錐(りっすい)の地なし",
      m: "ひとやものが密集していて、わずかな空間もないさま",
    },
    { k: "社稷(しゃしょく)塩となる", m: "国家が滅びることのたとえ" },
    {
      k: "俯仰(ふぎょう)天地に愧じず",
      m: "自分の行動に何もやましいところがない",
    },
    {
      k: "鼈(べつ)人を食わさんとして却って人に食わる",
      m: "人に危害をくわようとして、却って自分が災いを受けること",
    },
    {
      k: "良馬は鞭影を見て行く",
      m: "他人の指示がなくても行動できることのたとえ",
    },
    {
      k: "驪竜領下(りりょうがんか)の珠",
      m: "危険を冒さないと手に入らない貴重なもののたとえ",
    },
    {
      k: "苛政(かせい)は虎よりも猛し",
      m: "過酷な政治は、虎の害よりも甚大であること",
    },
    {
      k: "門前雀羅(もんぜんじゃくら)を張る",
      m: "訪ねてくる客もおらず、物寂しいさま",
    },
    {
      k: "独活(うど)の大木",
      m: "体が大きいだけでなんの役にも立たない人のたとえ",
    },
    {
      k: "暖簾(のれん)に腕押し",
      m: "力を加えてもなんの反応もないことのたとえ(返事がない、ただの...)",
    },
    {
      k: "馬鹿と鋏(はさみ)は使いよう",
      m: "愚かな人でも、使いようによっては役に立つこと",
    },
    {
      k: "角を矯(た)めて牛を殺す",
      m: "小さな欠点を直すつもりが、かえって全体をダメにしてしまうことのたとえ",
    },
    {
      k: "李下に冠を正さず",
      m: "人から勘違いされたり、疑われるようなことは慎んだほうがいい",
    },
    {
      k: "人と屏風は直には立たず",
      m: "人は正論ばかりではなく、妥協もしないと、うまく世の中を渡っていけないということ",
    },
    {
      k: "梨の礫(つぶて)",
      m: "返事がないこと、音沙汰がないこと(返事がない、ただの...)",
    },
    { k: "駿河の富士と一里塚", m: "比べ物にならないことのたとえ" },
    {
      k: "坊主憎けりゃ袈裟まで憎い",
      m: "その人を憎むあまり、その人に関する全ての事柄まで憎くなってしまうこと",
    },
    { k: "寝た牛に芥(あくた)掛くる", m: "無関係の人に罪をなすりつけること" },
    {
      k: "匹夫(ひっぷ)も志を奪うべからず",
      m: "どんなに地位の低い人であっても、志は尊重すべきであるということ",
    },
    {
      k: "栴檀(せんだん)は双葉より芳し",
      m: "大成する人は、幼いことから優れているということ",
    },
    {
      k: "骨折り損の草臥れ(くたびれ)儲け",
      m: "疲れるだけで何も成果がないこと",
    },
  ];

