//ボタンを押した時に出てくる漢字の配列

export const yojijyukugoSet = [
  { k: "人心収攬", m: "じんしんしゅうらん: 人の心をうまく掴むこと" },
  {
    k: "彫心鏤骨",
    m: "ちょうしんるこつ: 詩や文章などを書く際に非常に苦労して作り上げること",
  },
  { k: "桃李成蹊", m: "とうりせいけい: 徳を慕って自ずと人が集まること" },
  { k: "罵詈讒謗", m: "ばりぞうごん: 徳を慕って自ずと人が集まること" },
  {
    k: "尸位粗餐",
    m: "しいそさん: ある地位についているのに、その職務を果たさないこと",
  },
  { k: "椿萱並茂", m: "ちんけんへいも: 両親がともに健在であること" },
  { k: "披刑斬棘", m: "ひけいざんぎゃく: 困難を克服しながら前進すること" },
  { k: "衆賢茅茹", m: "しゅうかぼうじょ: たくさんの賢者が協力すること" },
  { k: "艱難辛苦", m: "なんかんしんく: 困難な目にあって苦しむこと" },
  { k: "羞月閉花", m: "しゅうかへいげつ: 美人のこと" },
  { k: "侈衣美食", m: "しいびしょく: 贅沢なたとえ" },
  {
    k: "茅堵蕭然",
    m: "ぼうとしょうぜん: かやぶきの垣根で粗末な家が物寂しいさま",
  },
  { k: "放蕩不覊", m: "ほうとうふき: 勝手気ままに振る舞うこと" },
  { k: "頑迷固陋", m: "がんめいころう: 頑固で視野が狭いこと" },
  { k: "苦心惨憺", m: "くしんさんたん: 苦労を重ね、工夫を凝らすこと" },
  {
    k: "洒洒落落",
    m: "しゃしゃらくらく: さっぱりしていて物事に執着しない性格、言動のこと",
  },
  {
    k: "斎戒沐浴",
    m: "さいかいもくよく: 神仏への祈りや、神聖な儀式の際に、飲食や行動を慎み、身を清めること",
  },
  {
    k: "聚蚊成雷",
    m: "しゅうかせいらい: 小さなものでも、たくさん集まれば大きな力になること",
  },
  { k: "痩身矮躯", m: "そうしんそうく: 痩せ細って体が小さいこと" },
  { k: "簇酒斂衣", m: "そうしゅれんい: 貧しい生活の例え" },
  {
    k: "断爛朝報",
    m: "だんらんちょうほう: 切れ切れになって続きがわからない朝廷の記録のこと",
  },
  {
    k: "笑面夜叉",
    m: "えんめんやしゃ: 笑っていても、心の底は陰険で裏表のある人",
  },
  { k: "攘臂疾言", m: "じょうひしつげん: 得意げな様子" },
  {
    k: "焦頭爛額",
    m: "しょうとうらんがく: 大事なことを忘れて、些細なことを重視すること。また物事を苦労して行うこと",
  },
  { k: "晨夜兼道", m: "しんやけんどう: 昼夜問わず仕事を急ぐこと" },
  {
    k: "塵飯塗羹",
    m: "じんぱんとこう: なんの役にも立たないもの、取るに足らないもの",
  },
  {
    k: "脣亡歯寒",
    m: "しんぼうしかん: 密接な関係にある中で、片方がなくなると、もう片方も危険な状態になること",
  },
  { k: "隋珠和璧", m: "ずいしゅかへき: 貴重な宝物" },
  { k: "炊金鐉玉", m: "すいきんせんぎょく: 豪華なご馳走のこと" },
  {
    k: "彩鳳随鴉",
    m: "さいほうずいあ: 自分よりも劣っている人に嫁ぐこと、またそれに不満を持つこと。転じて、妻が夫をぞんざいに扱うこと",
  },
  {
    k: "豺狼当路",
    m: "さいろうとうじ: 冷酷で非道な人が権力を握っているさま。また権力をふるって暴虐な行為をすること",
  },
  { k: "菜圃麦隴", m: "さいえんばくろう: 畑のこと" },
  {
    k: "灑掃応対",
    m: "さいそうおうたい: 日常生活において必要な仕事や作法のこと",
  },
  { k: "鑿壁偸光", m: "さくへきとうこう: 苦学することのたとえ" },
  { k: "于疎空闊", m: "うそくうかつ: 回りくどく実際に役に立たないこと" },
  {
    k: "禹行舜趨",
    m: "うこうしゅんすう: 見た目を真似しているだけで中身は伴っていないこと",
  },
  { k: "一饋十起", m: "いっきじっき: 熱心に賢者を集めるさま" },
  {
    k: "一丘一壑",
    m: "いっきゅういちがく: 俗世間を離れ、自然の中に身を置き、風流を楽しむこと",
  },
  { k: "一家眷属", m: "いっかけんぞく: 家族、または家臣、部下" },
  { k: "遏悪揚善", m: "あつあくようぜん: 悪意を禁じて善行をすすめること" },
  {
    k: "鴉巣生鳳",
    m: "あそうせいほう: 愚鈍な親が優れた子を産むたとえ。鳶が鷹を生むと同じ意味",
  },
  { k: "偕老同穴", m: "かいろうどうけつ: 夫婦が仲睦まじいこと" },
  { k: "管窺蠡測", m: "かんきれいそく: 見識が狭いこと" },
  {
    k: "対驢撫琴",
    m: "たいろぶきん: 愚かな人に道理を説いても、無駄であるということ",
  },
  { k: "断鶴続鳧", m: "だんかくぞくふ: 後先考えず自然に手を加え損なうこと" },
  { k: "袒裼裸裎", m: "たんせきらてい: 非常に無礼なさま" },
  {
    k: "磨礱砥礪",
    m: "まろうしれい: 気がつかないうちに、ものがすり減ってしまうたとえ",
  },
  { k: "霧鬢風鬟", m: "むびんふうかん: 美しい髪のこと" },
  { k: "銘肌鏤骨", m: "めいきるこつ: 心に深く刻み込んで忘れないこと" },
  {
    k: "和羹塩梅",
    m: "わこうあんばい: 主君を助けて、国を治める優秀な大臣、宰相のこと",
  },
];
